__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 48)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 48, 50)       900         input_2[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
gru_1 (GRU)                     (None, 48, 128)      68736       embedding_1[0][0]                
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 48, 1024)     68196168    input_1[0][0]                    
__________________________________________________________________________________________________
gru_2 (GRU)                     (None, 48, 128)      98688       gru_1[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 48, 1152)     0           sequential_1[1][0]               
                                                                 gru_2[0][0]                      
__________________________________________________________________________________________________
gru_3 (GRU)                     (None, 48, 512)      2557440     concatenate_1[0][0]              
__________________________________________________________________________________________________
gru_4 (GRU)                     (None, 512)          1574400     gru_3[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 18)           9234        gru_4[0][0]                      
==================================================================================================
Total params: 72,505,566
Trainable params: 72,505,566
Non-trainable params: 0
__________________________________________________________________________________________________
